Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/hsmci.h
/* -------- HSMCI_ARGR : (HSMCI Offset: 0x10) (R/W 32) Argument Register -------- */
#define HSMCI_ARGR_ARG_Pos                    _UINT32_(0)                                          /* (HSMCI_ARGR) Command Argument Position */
#define HSMCI_ARGR_ARG_Msk                    (_UINT32_(0xFFFFFFFF) << HSMCI_ARGR_ARG_Pos)         /* (HSMCI_ARGR) Command Argument Mask */
#define HSMCI_ARGR_ARG(value)                 (HSMCI_ARGR_ARG_Msk & (_UINT32_(value) << HSMCI_ARGR_ARG_Pos)) /* Assignment of value for ARG in the HSMCI_ARGR register */
#define HSMCI_ARGR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (HSMCI_ARGR) Register Mask  */


/* -------- HSMCI_CMDR : (HSMCI Offset: 0x14) ( /W 32) Command Register -------- */
#define HSMCI_CMDR_CMDNB_Pos                  _UINT32_(0)                                          /* (HSMCI_CMDR) Command Number Position */
#define HSMCI_CMDR_CMDNB_Msk                  (_UINT32_(0x3F) << HSMCI_CMDR_CMDNB_Pos)             /* (HSMCI_CMDR) Command Number Mask */
#define HSMCI_CMDR_CMDNB(value)               (HSMCI_CMDR_CMDNB_Msk & (_UINT32_(value) << HSMCI_CMDR_CMDNB_Pos)) /* Assignment of value for CMDNB in the HSMCI_CMDR register */
#define HSMCI_CMDR_RSPTYP_Pos                 _UINT32_(6)                                          /* (HSMCI_CMDR) Response Type Position */
#define HSMCI_CMDR_RSPTYP_Msk                 (_UINT32_(0x3) << HSMCI_CMDR_RSPTYP_Pos)             /* (HSMCI_CMDR) Response Type Mask */
#define HSMCI_CMDR_RSPTYP(value)              (HSMCI_CMDR_RSPTYP_Msk & (_UINT32_(value) << HSMCI_CMDR_RSPTYP_Pos)) /* Assignment of value for RSPTYP in the HSMCI_CMDR register */
#define   HSMCI_CMDR_RSPTYP_NORESP_Val        _UINT32_(0x0)                                        /* (HSMCI_CMDR) No response  */
#define   HSMCI_CMDR_RSPTYP_48_BIT_Val        _UINT32_(0x1)                                        /* (HSMCI_CMDR) 48-bit response  */
#define   HSMCI_CMDR_RSPTYP_136_BIT_Val       _UINT32_(0x2)                                        /* (HSMCI_CMDR) 136-bit response  */
#define   HSMCI_CMDR_RSPTYP_R1B_Val           _UINT32_(0x3)                                        /* (HSMCI_CMDR) R1b response type  */
#define HSMCI_CMDR_RSPTYP_NORESP              (HSMCI_CMDR_RSPTYP_NORESP_Val << HSMCI_CMDR_RSPTYP_Pos) /* (HSMCI_CMDR) No response Position */
#define HSMCI_CMDR_RSPTYP_48_BIT              (HSMCI_CMDR_RSPTYP_48_BIT_Val << HSMCI_CMDR_RSPTYP_Pos) /* (HSMCI_CMDR) 48-bit response Position */
#define HSMCI_CMDR_RSPTYP_136_BIT             (HSMCI_CMDR_RSPTYP_136_BIT_Val << HSMCI_CMDR_RSPTYP_Pos) /* (HSMCI_CMDR) 136-bit response Position */
#define HSMCI_CMDR_RSPTYP_R1B                 (HSMCI_CMDR_RSPTYP_R1B_Val << HSMCI_CMDR_RSPTYP_Pos) /* (HSMCI_CMDR) R1b response type Position */
#define HSMCI_CMDR_SPCMD_Pos                  _UINT32_(8)                                          /* (HSMCI_CMDR) Special Command Position */
#define HSMCI_CMDR_SPCMD_Msk                  (_UINT32_(0x7) << HSMCI_CMDR_SPCMD_Pos)              /* (HSMCI_CMDR) Special Command Mask */
#define HSMCI_CMDR_SPCMD(value)               (HSMCI_CMDR_SPCMD_Msk & (_UINT32_(value) << HSMCI_CMDR_SPCMD_Pos)) /* Assignment of value for SPCMD in the HSMCI_CMDR register */
#define   HSMCI_CMDR_SPCMD_STD_Val            _UINT32_(0x0)                                        /* (HSMCI_CMDR) Not a special CMD.  */
#define   HSMCI_CMDR_SPCMD_INIT_Val           _UINT32_(0x1)                                        /* (HSMCI_CMDR) Initialization CMD: 74 clock cycles for initialization sequence.  */
#define   HSMCI_CMDR_SPCMD_SYNC_Val           _UINT32_(0x2)                                        /* (HSMCI_CMDR) Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command.  */
#define   HSMCI_CMDR_SPCMD_CE_ATA_Val         _UINT32_(0x3)                                        /* (HSMCI_CMDR) CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line.  */
#define   HSMCI_CMDR_SPCMD_IT_CMD_Val         _UINT32_(0x4)                                        /* (HSMCI_CMDR) Interrupt command: Corresponds to the Interrupt Mode (CMD40).  */
#define   HSMCI_CMDR_SPCMD_IT_RESP_Val        _UINT32_(0x5)                                        /* (HSMCI_CMDR) Interrupt response: Corresponds to the Interrupt Mode (CMD40).  */
#define   HSMCI_CMDR_SPCMD_BOR_Val            _UINT32_(0x6)                                        /* (HSMCI_CMDR) Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly.  */
#define   HSMCI_CMDR_SPCMD_EBO_Val            _UINT32_(0x7)                                        /* (HSMCI_CMDR) End Boot Operation. This command allows the host processor to terminate the boot operation mode.  */
#define HSMCI_CMDR_SPCMD_STD                  (HSMCI_CMDR_SPCMD_STD_Val << HSMCI_CMDR_SPCMD_Pos)   /* (HSMCI_CMDR) Not a special CMD. Position */
#define HSMCI_CMDR_SPCMD_INIT                 (HSMCI_CMDR_SPCMD_INIT_Val << HSMCI_CMDR_SPCMD_Pos)  /* (HSMCI_CMDR) Initialization CMD: 74 clock cycles for initialization sequence. Position */
#define HSMCI_CMDR_SPCMD_SYNC                 (HSMCI_CMDR_SPCMD_SYNC_Val << HSMCI_CMDR_SPCMD_Pos)  /* (HSMCI_CMDR) Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command. Position */
#define HSMCI_CMDR_SPCMD_CE_ATA               (HSMCI_CMDR_SPCMD_CE_ATA_Val << HSMCI_CMDR_SPCMD_Pos) /* (HSMCI_CMDR) CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line. Position */
#define HSMCI_CMDR_SPCMD_IT_CMD               (HSMCI_CMDR_SPCMD_IT_CMD_Val << HSMCI_CMDR_SPCMD_Pos) /* (HSMCI_CMDR) Interrupt command: Corresponds to the Interrupt Mode (CMD40). Position */
#define HSMCI_CMDR_SPCMD_IT_RESP              (HSMCI_CMDR_SPCMD_IT_RESP_Val << HSMCI_CMDR_SPCMD_Pos) /* (HSMCI_CMDR) Interrupt response: Corresponds to the Interrupt Mode (CMD40). Position */
#define HSMCI_CMDR_SPCMD_BOR                  (HSMCI_CMDR_SPCMD_BOR_Val << HSMCI_CMDR_SPCMD_Pos)   /* (HSMCI_CMDR) Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly. Position */
#define HSMCI_CMDR_SPCMD_EBO                  (HSMCI_CMDR_SPCMD_EBO_Val << HSMCI_CMDR_SPCMD_Pos)   /* (HSMCI_CMDR) End Boot Operation. This command allows the host processor to terminate the boot operation mode. Position */
#define HSMCI_CMDR_OPDCMD_Pos                 _UINT32_(11)                                         /* (HSMCI_CMDR) Open Drain Command Position */
#define HSMCI_CMDR_OPDCMD_Msk                 (_UINT32_(0x1) << HSMCI_CMDR_OPDCMD_Pos)             /* (HSMCI_CMDR) Open Drain Command Mask */
#define HSMCI_CMDR_OPDCMD(value)              (HSMCI_CMDR_OPDCMD_Msk & (_UINT32_(value) << HSMCI_CMDR_OPDCMD_Pos)) /* Assignment of value for OPDCMD in the HSMCI_CMDR register */
#define   HSMCI_CMDR_OPDCMD_PUSHPULL_Val      _UINT32_(0x0)                                        /* (HSMCI_CMDR) Push pull command.  */
#define   HSMCI_CMDR_OPDCMD_OPENDRAIN_Val     _UINT32_(0x1)                                        /* (HSMCI_CMDR) Open drain command.  */
#define HSMCI_CMDR_OPDCMD_PUSHPULL            (HSMCI_CMDR_OPDCMD_PUSHPULL_Val << HSMCI_CMDR_OPDCMD_Pos) /* (HSMCI_CMDR) Push pull command. Position */
#define HSMCI_CMDR_OPDCMD_OPENDRAIN           (HSMCI_CMDR_OPDCMD_OPENDRAIN_Val << HSMCI_CMDR_OPDCMD_Pos) /* (HSMCI_CMDR) Open drain command. Position */
#define HSMCI_CMDR_MAXLAT_Pos                 _UINT32_(12)                                         /* (HSMCI_CMDR) Max Latency for Command to Response Position */
#define HSMCI_CMDR_MAXLAT_Msk                 (_UINT32_(0x1) << HSMCI_CMDR_MAXLAT_Pos)             /* (HSMCI_CMDR) Max Latency for Command to Response Mask */
#define HSMCI_CMDR_MAXLAT(value)              (HSMCI_CMDR_MAXLAT_Msk & (_UINT32_(value) << HSMCI_CMDR_MAXLAT_Pos)) /* Assignment of value for MAXLAT in the HSMCI_CMDR register */
#define   HSMCI_CMDR_MAXLAT_5_Val             _UINT32_(0x0)                                        /* (HSMCI_CMDR) 5-cycle max latency.  */
#define   HSMCI_CMDR_MAXLAT_64_Val            _UINT32_(0x1)                                        /* (HSMCI_CMDR) 64-cycle max latency.  */
#define HSMCI_CMDR_MAXLAT_5                   (HSMCI_CMDR_MAXLAT_5_Val << HSMCI_CMDR_MAXLAT_Pos)   /* (HSMCI_CMDR) 5-cycle max latency. Position */
#define HSMCI_CMDR_MAXLAT_64                  (HSMCI_CMDR_MAXLAT_64_Val << HSMCI_CMDR_MAXLAT_Pos)  /* (HSMCI_CMDR) 64-cycle max latency. Position */
#define HSMCI_CMDR_TRCMD_Pos                  _UINT32_(16)                                         /* (HSMCI_CMDR) Transfer Command Position */
#define HSMCI_CMDR_TRCMD_Msk                  (_UINT32_(0x3) << HSMCI_CMDR_TRCMD_Pos)              /* (HSMCI_CMDR) Transfer Command Mask */
#define HSMCI_CMDR_TRCMD(value)               (HSMCI_CMDR_TRCMD_Msk & (_UINT32_(value) << HSMCI_CMDR_TRCMD_Pos)) /* Assignment of value for TRCMD in the HSMCI_CMDR register */
#define   HSMCI_CMDR_TRCMD_NO_DATA_Val        _UINT32_(0x0)                                        /* (HSMCI_CMDR) No data transfer  */
#define   HSMCI_CMDR_TRCMD_START_DATA_Val     _UINT32_(0x1)                                        /* (HSMCI_CMDR) Start data transfer  */
#define   HSMCI_CMDR_TRCMD_STOP_DATA_Val      _UINT32_(0x2)                                        /* (HSMCI_CMDR) Stop data transfer  */
#define HSMCI_CMDR_TRCMD_NO_DATA              (HSMCI_CMDR_TRCMD_NO_DATA_Val << HSMCI_CMDR_TRCMD_Pos) /* (HSMCI_CMDR) No data transfer Position */
#define HSMCI_CMDR_TRCMD_START_DATA           (HSMCI_CMDR_TRCMD_START_DATA_Val << HSMCI_CMDR_TRCMD_Pos) /* (HSMCI_CMDR) Start data transfer Position */
#define HSMCI_CMDR_TRCMD_STOP_DATA            (HSMCI_CMDR_TRCMD_STOP_DATA_Val << HSMCI_CMDR_TRCMD_Pos) /* (HSMCI_CMDR) Stop data transfer Position */
#define HSMCI_CMDR_TRDIR_Pos                  _UINT32_(18)                                         /* (HSMCI_CMDR) Transfer Direction Position */
#define HSMCI_CMDR_TRDIR_Msk                  (_UINT32_(0x1) << HSMCI_CMDR_TRDIR_Pos)              /* (HSMCI_CMDR) Transfer Direction Mask */
#define HSMCI_CMDR_TRDIR(value)               (HSMCI_CMDR_TRDIR_Msk & (_UINT32_(value) << HSMCI_CMDR_TRDIR_Pos)) /* Assignment of value for TRDIR in the HSMCI_CMDR register */
#define   HSMCI_CMDR_TRDIR_WRITE_Val          _UINT32_(0x0)                                        /* (HSMCI_CMDR) Write.  */
#define   HSMCI_CMDR_TRDIR_READ_Val           _UINT32_(0x1)                                        /* (HSMCI_CMDR) Read.  */
#define HSMCI_CMDR_TRDIR_WRITE                (HSMCI_CMDR_TRDIR_WRITE_Val << HSMCI_CMDR_TRDIR_Pos) /* (HSMCI_CMDR) Write. Position */
#define HSMCI_CMDR_TRDIR_READ                 (HSMCI_CMDR_TRDIR_READ_Val << HSMCI_CMDR_TRDIR_Pos)  /* (HSMCI_CMDR) Read. Position */
#define HSMCI_CMDR_TRTYP_Pos                  _UINT32_(19)                                         /* (HSMCI_CMDR) Transfer Type Position */
#define HSMCI_CMDR_TRTYP_Msk                  (_UINT32_(0x7) << HSMCI_CMDR_TRTYP_Pos)              /* (HSMCI_CMDR) Transfer Type Mask */
#define HSMCI_CMDR_TRTYP(value)               (HSMCI_CMDR_TRTYP_Msk & (_UINT32_(value) << HSMCI_CMDR_TRTYP_Pos)) /* Assignment of value for TRTYP in the HSMCI_CMDR register */
#define   HSMCI_CMDR_TRTYP_SINGLE_Val         _UINT32_(0x0)                                        /* (HSMCI_CMDR) MMC/SD Card Single Block  */
#define   HSMCI_CMDR_TRTYP_MULTIPLE_Val       _UINT32_(0x1)                                        /* (HSMCI_CMDR) MMC/SD Card Multiple Block  */
#define   HSMCI_CMDR_TRTYP_STREAM_Val         _UINT32_(0x2)                                        /* (HSMCI_CMDR) MMC Stream  */
#define   HSMCI_CMDR_TRTYP_BYTE_Val           _UINT32_(0x4)                                        /* (HSMCI_CMDR) SDIO Byte  */
#define   HSMCI_CMDR_TRTYP_BLOCK_Val          _UINT32_(0x5)                                        /* (HSMCI_CMDR) SDIO Block  */
#define HSMCI_CMDR_TRTYP_SINGLE               (HSMCI_CMDR_TRTYP_SINGLE_Val << HSMCI_CMDR_TRTYP_Pos) /* (HSMCI_CMDR) MMC/SD Card Single Block Position */
#define HSMCI_CMDR_TRTYP_MULTIPLE             (HSMCI_CMDR_TRTYP_MULTIPLE_Val << HSMCI_CMDR_TRTYP_Pos) /* (HSMCI_CMDR) MMC/SD Card Multiple Block Position */
#define HSMCI_CMDR_TRTYP_STREAM               (HSMCI_CMDR_TRTYP_STREAM_Val << HSMCI_CMDR_TRTYP_Pos) /* (HSMCI_CMDR) MMC Stream Position */
#define HSMCI_CMDR_TRTYP_BYTE                 (HSMCI_CMDR_TRTYP_BYTE_Val << HSMCI_CMDR_TRTYP_Pos)  /* (HSMCI_CMDR) SDIO Byte Position */
#define HSMCI_CMDR_TRTYP_BLOCK                (HSMCI_CMDR_TRTYP_BLOCK_Val << HSMCI_CMDR_TRTYP_Pos) /* (HSMCI_CMDR) SDIO Block Position */
#define HSMCI_CMDR_IOSPCMD_Pos                _UINT32_(24)                                         /* (HSMCI_CMDR) SDIO Special Command Position */
#define HSMCI_CMDR_IOSPCMD_Msk                (_UINT32_(0x3) << HSMCI_CMDR_IOSPCMD_Pos)            /* (HSMCI_CMDR) SDIO Special Command Mask */
#define HSMCI_CMDR_IOSPCMD(value)             (HSMCI_CMDR_IOSPCMD_Msk & (_UINT32_(value) << HSMCI_CMDR_IOSPCMD_Pos)) /* Assignment of value for IOSPCMD in the HSMCI_CMDR register */
#define   HSMCI_CMDR_IOSPCMD_STD_Val          _UINT32_(0x0)                                        /* (HSMCI_CMDR) Not an SDIO Special Command  */
#define   HSMCI_CMDR_IOSPCMD_SUSPEND_Val      _UINT32_(0x1)                                        /* (HSMCI_CMDR) SDIO Suspend Command  */
#define   HSMCI_CMDR_IOSPCMD_RESUME_Val       _UINT32_(0x2)                                        /* (HSMCI_CMDR) SDIO Resume Command  */
#define HSMCI_CMDR_IOSPCMD_STD                (HSMCI_CMDR_IOSPCMD_STD_Val << HSMCI_CMDR_IOSPCMD_Pos) /* (HSMCI_CMDR) Not an SDIO Special Command Position */
#define HSMCI_CMDR_IOSPCMD_SUSPEND            (HSMCI_CMDR_IOSPCMD_SUSPEND_Val << HSMCI_CMDR_IOSPCMD_Pos) /* (HSMCI_CMDR) SDIO Suspend Command Position */
#define HSMCI_CMDR_IOSPCMD_RESUME             (HSMCI_CMDR_IOSPCMD_RESUME_Val << HSMCI_CMDR_IOSPCMD_Pos) /* (HSMCI_CMDR) SDIO Resume Command Position */
#define HSMCI_CMDR_ATACS_Pos                  _UINT32_(26)                                         /* (HSMCI_CMDR) ATA with Command Completion Signal Position */
#define HSMCI_CMDR_ATACS_Msk                  (_UINT32_(0x1) << HSMCI_CMDR_ATACS_Pos)              /* (HSMCI_CMDR) ATA with Command Completion Signal Mask */
#define HSMCI_CMDR_ATACS(value)               (HSMCI_CMDR_ATACS_Msk & (_UINT32_(value) << HSMCI_CMDR_ATACS_Pos)) /* Assignment of value for ATACS in the HSMCI_CMDR register */
#define   HSMCI_CMDR_ATACS_NORMAL_Val         _UINT32_(0x0)                                        /* (HSMCI_CMDR) Normal operation mode.  */
#define   HSMCI_CMDR_ATACS_COMPLETION_Val     _UINT32_(0x1)                                        /* (HSMCI_CMDR) This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR).  */
#define HSMCI_CMDR_ATACS_NORMAL               (HSMCI_CMDR_ATACS_NORMAL_Val << HSMCI_CMDR_ATACS_Pos) /* (HSMCI_CMDR) Normal operation mode. Position */
#define HSMCI_CMDR_ATACS_COMPLETION           (HSMCI_CMDR_ATACS_COMPLETION_Val << HSMCI_CMDR_ATACS_Pos) /* (HSMCI_CMDR) This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR). Position */
#define HSMCI_CMDR_BOOT_ACK_Pos               _UINT32_(27)                                         /* (HSMCI_CMDR) Boot Operation Acknowledge Position */
#define HSMCI_CMDR_BOOT_ACK_Msk               (_UINT32_(0x1) << HSMCI_CMDR_BOOT_ACK_Pos)           /* (HSMCI_CMDR) Boot Operation Acknowledge Mask */
#define HSMCI_CMDR_BOOT_ACK(value)            (HSMCI_CMDR_BOOT_ACK_Msk & (_UINT32_(value) << HSMCI_CMDR_BOOT_ACK_Pos)) /* Assignment of value for BOOT_ACK in the HSMCI_CMDR register */
#define HSMCI_CMDR_Msk                        _UINT32_(0x0F3F1FFF)                                 /* (HSMCI_CMDR) Register Mask  */


/* -------- HSMCI_BLKR : (HSMCI Offset: 0x18) (R/W 32) Block Register -------- */
#define HSMCI_BLKR_BCNT_Pos                   _UINT32_(0)                                          /* (HSMCI_BLKR) MMC/SDIO Block Count - SDIO Byte Count Position */
#define HSMCI_BLKR_BCNT_Msk                   (_UINT32_(0xFFFF) << HSMCI_BLKR_BCNT_Pos)            /* (HSMCI_BLKR) MMC/SDIO Block Count - SDIO Byte Count Mask */
#define HSMCI_BLKR_BCNT(value)                (HSMCI_BLKR_BCNT_Msk & (_UINT32_(value) << HSMCI_BLKR_BCNT_Pos)) /* Assignment of value for BCNT in the HSMCI_BLKR register */
#define HSMCI_BLKR_BLKLEN_Pos                 _UINT32_(16)                                         /* (HSMCI_BLKR) Data Block Length Position */
#define HSMCI_BLKR_BLKLEN_Msk                 (_UINT32_(0xFFFF) << HSMCI_BLKR_BLKLEN_Pos)          /* (HSMCI_BLKR) Data Block Length Mask */
#define HSMCI_BLKR_BLKLEN(value)              (HSMCI_BLKR_BLKLEN_Msk & (_UINT32_(value) << HSMCI_BLKR_BLKLEN_Pos)) /* Assignment of value for BLKLEN in the HSMCI_BLKR register */
#define HSMCI_BLKR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (HSMCI_BLKR) Register Mask  */


/* -------- HSMCI_CSTOR : (HSMCI Offset: 0x1C) (R/W 32) Completion Signal Timeout Register -------- */
#define HSMCI_CSTOR_CSTOCYC_Pos               _UINT32_(0)                                          /* (HSMCI_CSTOR) Completion Signal Timeout Cycle Number Position */
#define HSMCI_CSTOR_CSTOCYC_Msk               (_UINT32_(0xF) << HSMCI_CSTOR_CSTOCYC_Pos)           /* (HSMCI_CSTOR) Completion Signal Timeout Cycle Number Mask */
#define HSMCI_CSTOR_CSTOCYC(value)            (HSMCI_CSTOR_CSTOCYC_Msk & (_UINT32_(value) << HSMCI_CSTOR_CSTOCYC_Pos)) /* Assignment of value for CSTOCYC in the HSMCI_CSTOR register */
#define HSMCI_CSTOR_CSTOMUL_Pos               _UINT32_(4)                                          /* (HSMCI_CSTOR) Completion Signal Timeout Multiplier Position */
#define HSMCI_CSTOR_CSTOMUL_Msk               (_UINT32_(0x7) << HSMCI_CSTOR_CSTOMUL_Pos)           /* (HSMCI_CSTOR) Completion Signal Timeout Multiplier Mask */
#define HSMCI_CSTOR_CSTOMUL(value)            (HSMCI_CSTOR_CSTOMUL_Msk & (_UINT32_(value) << HSMCI_CSTOR_CSTOMUL_Pos)) /* Assignment of value for CSTOMUL in the HSMCI_CSTOR register */
#define   HSMCI_CSTOR_CSTOMUL_1_Val           _UINT32_(0x0)                                        /* (HSMCI_CSTOR) CSTOCYC x 1  */
#define   HSMCI_CSTOR_CSTOMUL_16_Val          _UINT32_(0x1)                                        /* (HSMCI_CSTOR) CSTOCYC x 16  */
#define   HSMCI_CSTOR_CSTOMUL_128_Val         _UINT32_(0x2)                                        /* (HSMCI_CSTOR) CSTOCYC x 128  */
#define   HSMCI_CSTOR_CSTOMUL_256_Val         _UINT32_(0x3)                                        /* (HSMCI_CSTOR) CSTOCYC x 256  */
#define   HSMCI_CSTOR_CSTOMUL_1024_Val        _UINT32_(0x4)                                        /* (HSMCI_CSTOR) CSTOCYC x 1024  */
#define   HSMCI_CSTOR_CSTOMUL_4096_Val        _UINT32_(0x5)                                        /* (HSMCI_CSTOR) CSTOCYC x 4096  */
#define   HSMCI_CSTOR_CSTOMUL_65536_Val       _UINT32_(0x6)                                        /* (HSMCI_CSTOR) CSTOCYC x 65536  */
#define   HSMCI_CSTOR_CSTOMUL_1048576_Val     _UINT32_(0x7)                                        /* (HSMCI_CSTOR) CSTOCYC x 1048576  */
#define HSMCI_CSTOR_CSTOMUL_1                 (HSMCI_CSTOR_CSTOMUL_1_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 1 Position */
#define HSMCI_CSTOR_CSTOMUL_16                (HSMCI_CSTOR_CSTOMUL_16_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 16 Position */
#define HSMCI_CSTOR_CSTOMUL_128               (HSMCI_CSTOR_CSTOMUL_128_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 128 Position */
#define HSMCI_CSTOR_CSTOMUL_256               (HSMCI_CSTOR_CSTOMUL_256_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 256 Position */
#define HSMCI_CSTOR_CSTOMUL_1024              (HSMCI_CSTOR_CSTOMUL_1024_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 1024 Position */
#define HSMCI_CSTOR_CSTOMUL_4096              (HSMCI_CSTOR_CSTOMUL_4096_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 4096 Position */
#define HSMCI_CSTOR_CSTOMUL_65536             (HSMCI_CSTOR_CSTOMUL_65536_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 65536 Position */
#define HSMCI_CSTOR_CSTOMUL_1048576           (HSMCI_CSTOR_CSTOMUL_1048576_Val << HSMCI_CSTOR_CSTOMUL_Pos) /* (HSMCI_CSTOR) CSTOCYC x 1048576 Position */
#define HSMCI_CSTOR_Msk                       _UINT32_(0x0000007F)                                 /* (HSMCI_CSTOR) Register Mask  */


/* -------- HSMCI_RSPR : (HSMCI Offset: 0x20) ( R/ 32) Response Register 0 -------- */
#define HSMCI_RSPR_RSP_Pos                    _UINT32_(0)                                          /* (HSMCI_RSPR) Response Position */
#define HSMCI_RSPR_RSP_Msk                    (_UINT32_(0xFFFFFFFF) << HSMCI_RSPR_RSP_Pos)         /* (HSMCI_RSPR) Response Mask */
#define HSMCI_RSPR_RSP(value)                 (HSMCI_RSPR_RSP_Msk & (_UINT32_(value) << HSMCI_RSPR_RSP_Pos)) /* Assignment of value for RSP in the HSMCI_RSPR register */
#define HSMCI_RSPR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (HSMCI_RSPR) Register Mask  */


/* -------- HSMCI_RDR : (HSMCI Offset: 0x30) ( R/ 32) Receive Data Register -------- */
#define HSMCI_RDR_DATA_Pos                    _UINT32_(0)                                          /* (HSMCI_RDR) Data to Read Position */
#define HSMCI_RDR_DATA_Msk                    (_UINT32_(0xFFFFFFFF) << HSMCI_RDR_DATA_Pos)         /* (HSMCI_RDR) Data to Read Mask */
#define HSMCI_RDR_DATA(value)                 (HSMCI_RDR_DATA_Msk & (_UINT32_(value) << HSMCI_RDR_DATA_Pos)) /* Assignment of value for DATA in the HSMCI_RDR register */
#define HSMCI_RDR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (HSMCI_RDR) Register Mask  */


/* -------- HSMCI_TDR : (HSMCI Offset: 0x34) ( /W 32) Transmit Data Register -------- */
#define HSMCI_TDR_DATA_Pos                    _UINT32_(0)                                          /* (HSMCI_TDR) Data to Write Position */
#define HSMCI_TDR_DATA_Msk                    (_UINT32_(0xFFFFFFFF) << HSMCI_TDR_DATA_Pos)         /* (HSMCI_TDR) Data to Write Mask */
#define HSMCI_TDR_DATA(value)                 (HSMCI_TDR_DATA_Msk & (_UINT32_(value) << HSMCI_TDR_DATA_Pos)) /* Assignment of value for DATA in the HSMCI_TDR register */
#define HSMCI_TDR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (HSMCI_TDR) Register Mask  */


