Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/hsmci.h
/* -------- HSMCI_IER : (HSMCI Offset: 0x44) ( /W 32) Interrupt Enable Register -------- */
#define HSMCI_IER_CMDRDY_Pos                  _UINT32_(0)                                          /* (HSMCI_IER) Command Ready Interrupt Enable Position */
#define HSMCI_IER_CMDRDY_Msk                  (_UINT32_(0x1) << HSMCI_IER_CMDRDY_Pos)              /* (HSMCI_IER) Command Ready Interrupt Enable Mask */
#define HSMCI_IER_CMDRDY(value)               (HSMCI_IER_CMDRDY_Msk & (_UINT32_(value) << HSMCI_IER_CMDRDY_Pos)) /* Assignment of value for CMDRDY in the HSMCI_IER register */
#define HSMCI_IER_RXRDY_Pos                   _UINT32_(1)                                          /* (HSMCI_IER) Receiver Ready Interrupt Enable Position */
#define HSMCI_IER_RXRDY_Msk                   (_UINT32_(0x1) << HSMCI_IER_RXRDY_Pos)               /* (HSMCI_IER) Receiver Ready Interrupt Enable Mask */
#define HSMCI_IER_RXRDY(value)                (HSMCI_IER_RXRDY_Msk & (_UINT32_(value) << HSMCI_IER_RXRDY_Pos)) /* Assignment of value for RXRDY in the HSMCI_IER register */
#define HSMCI_IER_TXRDY_Pos                   _UINT32_(2)                                          /* (HSMCI_IER) Transmit Ready Interrupt Enable Position */
#define HSMCI_IER_TXRDY_Msk                   (_UINT32_(0x1) << HSMCI_IER_TXRDY_Pos)               /* (HSMCI_IER) Transmit Ready Interrupt Enable Mask */
#define HSMCI_IER_TXRDY(value)                (HSMCI_IER_TXRDY_Msk & (_UINT32_(value) << HSMCI_IER_TXRDY_Pos)) /* Assignment of value for TXRDY in the HSMCI_IER register */
#define HSMCI_IER_BLKE_Pos                    _UINT32_(3)                                          /* (HSMCI_IER) Data Block Ended Interrupt Enable Position */
#define HSMCI_IER_BLKE_Msk                    (_UINT32_(0x1) << HSMCI_IER_BLKE_Pos)                /* (HSMCI_IER) Data Block Ended Interrupt Enable Mask */
#define HSMCI_IER_BLKE(value)                 (HSMCI_IER_BLKE_Msk & (_UINT32_(value) << HSMCI_IER_BLKE_Pos)) /* Assignment of value for BLKE in the HSMCI_IER register */
#define HSMCI_IER_DTIP_Pos                    _UINT32_(4)                                          /* (HSMCI_IER) Data Transfer in Progress Interrupt Enable Position */
#define HSMCI_IER_DTIP_Msk                    (_UINT32_(0x1) << HSMCI_IER_DTIP_Pos)                /* (HSMCI_IER) Data Transfer in Progress Interrupt Enable Mask */
#define HSMCI_IER_DTIP(value)                 (HSMCI_IER_DTIP_Msk & (_UINT32_(value) << HSMCI_IER_DTIP_Pos)) /* Assignment of value for DTIP in the HSMCI_IER register */
#define HSMCI_IER_NOTBUSY_Pos                 _UINT32_(5)                                          /* (HSMCI_IER) Data Not Busy Interrupt Enable Position */
#define HSMCI_IER_NOTBUSY_Msk                 (_UINT32_(0x1) << HSMCI_IER_NOTBUSY_Pos)             /* (HSMCI_IER) Data Not Busy Interrupt Enable Mask */
#define HSMCI_IER_NOTBUSY(value)              (HSMCI_IER_NOTBUSY_Msk & (_UINT32_(value) << HSMCI_IER_NOTBUSY_Pos)) /* Assignment of value for NOTBUSY in the HSMCI_IER register */
#define HSMCI_IER_SDIOIRQA_Pos                _UINT32_(8)                                          /* (HSMCI_IER) SDIO Interrupt for Slot A Interrupt Enable Position */
#define HSMCI_IER_SDIOIRQA_Msk                (_UINT32_(0x1) << HSMCI_IER_SDIOIRQA_Pos)            /* (HSMCI_IER) SDIO Interrupt for Slot A Interrupt Enable Mask */
#define HSMCI_IER_SDIOIRQA(value)             (HSMCI_IER_SDIOIRQA_Msk & (_UINT32_(value) << HSMCI_IER_SDIOIRQA_Pos)) /* Assignment of value for SDIOIRQA in the HSMCI_IER register */
#define HSMCI_IER_SDIOWAIT_Pos                _UINT32_(12)                                         /* (HSMCI_IER) SDIO Read Wait Operation Status Interrupt Enable Position */
#define HSMCI_IER_SDIOWAIT_Msk                (_UINT32_(0x1) << HSMCI_IER_SDIOWAIT_Pos)            /* (HSMCI_IER) SDIO Read Wait Operation Status Interrupt Enable Mask */
#define HSMCI_IER_SDIOWAIT(value)             (HSMCI_IER_SDIOWAIT_Msk & (_UINT32_(value) << HSMCI_IER_SDIOWAIT_Pos)) /* Assignment of value for SDIOWAIT in the HSMCI_IER register */
#define HSMCI_IER_CSRCV_Pos                   _UINT32_(13)                                         /* (HSMCI_IER) Completion Signal Received Interrupt Enable Position */
#define HSMCI_IER_CSRCV_Msk                   (_UINT32_(0x1) << HSMCI_IER_CSRCV_Pos)               /* (HSMCI_IER) Completion Signal Received Interrupt Enable Mask */
#define HSMCI_IER_CSRCV(value)                (HSMCI_IER_CSRCV_Msk & (_UINT32_(value) << HSMCI_IER_CSRCV_Pos)) /* Assignment of value for CSRCV in the HSMCI_IER register */
#define HSMCI_IER_RINDE_Pos                   _UINT32_(16)                                         /* (HSMCI_IER) Response Index Error Interrupt Enable Position */
#define HSMCI_IER_RINDE_Msk                   (_UINT32_(0x1) << HSMCI_IER_RINDE_Pos)               /* (HSMCI_IER) Response Index Error Interrupt Enable Mask */
#define HSMCI_IER_RINDE(value)                (HSMCI_IER_RINDE_Msk & (_UINT32_(value) << HSMCI_IER_RINDE_Pos)) /* Assignment of value for RINDE in the HSMCI_IER register */
#define HSMCI_IER_RDIRE_Pos                   _UINT32_(17)                                         /* (HSMCI_IER) Response Direction Error Interrupt Enable Position */
#define HSMCI_IER_RDIRE_Msk                   (_UINT32_(0x1) << HSMCI_IER_RDIRE_Pos)               /* (HSMCI_IER) Response Direction Error Interrupt Enable Mask */
#define HSMCI_IER_RDIRE(value)                (HSMCI_IER_RDIRE_Msk & (_UINT32_(value) << HSMCI_IER_RDIRE_Pos)) /* Assignment of value for RDIRE in the HSMCI_IER register */
#define HSMCI_IER_RCRCE_Pos                   _UINT32_(18)                                         /* (HSMCI_IER) Response CRC Error Interrupt Enable Position */
#define HSMCI_IER_RCRCE_Msk                   (_UINT32_(0x1) << HSMCI_IER_RCRCE_Pos)               /* (HSMCI_IER) Response CRC Error Interrupt Enable Mask */
#define HSMCI_IER_RCRCE(value)                (HSMCI_IER_RCRCE_Msk & (_UINT32_(value) << HSMCI_IER_RCRCE_Pos)) /* Assignment of value for RCRCE in the HSMCI_IER register */
#define HSMCI_IER_RENDE_Pos                   _UINT32_(19)                                         /* (HSMCI_IER) Response End Bit Error Interrupt Enable Position */
#define HSMCI_IER_RENDE_Msk                   (_UINT32_(0x1) << HSMCI_IER_RENDE_Pos)               /* (HSMCI_IER) Response End Bit Error Interrupt Enable Mask */
#define HSMCI_IER_RENDE(value)                (HSMCI_IER_RENDE_Msk & (_UINT32_(value) << HSMCI_IER_RENDE_Pos)) /* Assignment of value for RENDE in the HSMCI_IER register */
#define HSMCI_IER_RTOE_Pos                    _UINT32_(20)                                         /* (HSMCI_IER) Response Time-out Error Interrupt Enable Position */
#define HSMCI_IER_RTOE_Msk                    (_UINT32_(0x1) << HSMCI_IER_RTOE_Pos)                /* (HSMCI_IER) Response Time-out Error Interrupt Enable Mask */
#define HSMCI_IER_RTOE(value)                 (HSMCI_IER_RTOE_Msk & (_UINT32_(value) << HSMCI_IER_RTOE_Pos)) /* Assignment of value for RTOE in the HSMCI_IER register */
#define HSMCI_IER_DCRCE_Pos                   _UINT32_(21)                                         /* (HSMCI_IER) Data CRC Error Interrupt Enable Position */
#define HSMCI_IER_DCRCE_Msk                   (_UINT32_(0x1) << HSMCI_IER_DCRCE_Pos)               /* (HSMCI_IER) Data CRC Error Interrupt Enable Mask */
#define HSMCI_IER_DCRCE(value)                (HSMCI_IER_DCRCE_Msk & (_UINT32_(value) << HSMCI_IER_DCRCE_Pos)) /* Assignment of value for DCRCE in the HSMCI_IER register */
#define HSMCI_IER_DTOE_Pos                    _UINT32_(22)                                         /* (HSMCI_IER) Data Time-out Error Interrupt Enable Position */
#define HSMCI_IER_DTOE_Msk                    (_UINT32_(0x1) << HSMCI_IER_DTOE_Pos)                /* (HSMCI_IER) Data Time-out Error Interrupt Enable Mask */
#define HSMCI_IER_DTOE(value)                 (HSMCI_IER_DTOE_Msk & (_UINT32_(value) << HSMCI_IER_DTOE_Pos)) /* Assignment of value for DTOE in the HSMCI_IER register */
#define HSMCI_IER_CSTOE_Pos                   _UINT32_(23)                                         /* (HSMCI_IER) Completion Signal Timeout Error Interrupt Enable Position */
#define HSMCI_IER_CSTOE_Msk                   (_UINT32_(0x1) << HSMCI_IER_CSTOE_Pos)               /* (HSMCI_IER) Completion Signal Timeout Error Interrupt Enable Mask */
#define HSMCI_IER_CSTOE(value)                (HSMCI_IER_CSTOE_Msk & (_UINT32_(value) << HSMCI_IER_CSTOE_Pos)) /* Assignment of value for CSTOE in the HSMCI_IER register */
#define HSMCI_IER_BLKOVRE_Pos                 _UINT32_(24)                                         /* (HSMCI_IER) DMA Block Overrun Error Interrupt Enable Position */
#define HSMCI_IER_BLKOVRE_Msk                 (_UINT32_(0x1) << HSMCI_IER_BLKOVRE_Pos)             /* (HSMCI_IER) DMA Block Overrun Error Interrupt Enable Mask */
#define HSMCI_IER_BLKOVRE(value)              (HSMCI_IER_BLKOVRE_Msk & (_UINT32_(value) << HSMCI_IER_BLKOVRE_Pos)) /* Assignment of value for BLKOVRE in the HSMCI_IER register */
#define HSMCI_IER_FIFOEMPTY_Pos               _UINT32_(26)                                         /* (HSMCI_IER) FIFO empty Interrupt enable Position */
#define HSMCI_IER_FIFOEMPTY_Msk               (_UINT32_(0x1) << HSMCI_IER_FIFOEMPTY_Pos)           /* (HSMCI_IER) FIFO empty Interrupt enable Mask */
#define HSMCI_IER_FIFOEMPTY(value)            (HSMCI_IER_FIFOEMPTY_Msk & (_UINT32_(value) << HSMCI_IER_FIFOEMPTY_Pos)) /* Assignment of value for FIFOEMPTY in the HSMCI_IER register */
#define HSMCI_IER_XFRDONE_Pos                 _UINT32_(27)                                         /* (HSMCI_IER) Transfer Done Interrupt enable Position */
#define HSMCI_IER_XFRDONE_Msk                 (_UINT32_(0x1) << HSMCI_IER_XFRDONE_Pos)             /* (HSMCI_IER) Transfer Done Interrupt enable Mask */
#define HSMCI_IER_XFRDONE(value)              (HSMCI_IER_XFRDONE_Msk & (_UINT32_(value) << HSMCI_IER_XFRDONE_Pos)) /* Assignment of value for XFRDONE in the HSMCI_IER register */
#define HSMCI_IER_ACKRCV_Pos                  _UINT32_(28)                                         /* (HSMCI_IER) Boot Acknowledge Interrupt Enable Position */
#define HSMCI_IER_ACKRCV_Msk                  (_UINT32_(0x1) << HSMCI_IER_ACKRCV_Pos)              /* (HSMCI_IER) Boot Acknowledge Interrupt Enable Mask */
#define HSMCI_IER_ACKRCV(value)               (HSMCI_IER_ACKRCV_Msk & (_UINT32_(value) << HSMCI_IER_ACKRCV_Pos)) /* Assignment of value for ACKRCV in the HSMCI_IER register */
#define HSMCI_IER_ACKRCVE_Pos                 _UINT32_(29)                                         /* (HSMCI_IER) Boot Acknowledge Error Interrupt Enable Position */
#define HSMCI_IER_ACKRCVE_Msk                 (_UINT32_(0x1) << HSMCI_IER_ACKRCVE_Pos)             /* (HSMCI_IER) Boot Acknowledge Error Interrupt Enable Mask */
#define HSMCI_IER_ACKRCVE(value)              (HSMCI_IER_ACKRCVE_Msk & (_UINT32_(value) << HSMCI_IER_ACKRCVE_Pos)) /* Assignment of value for ACKRCVE in the HSMCI_IER register */
#define HSMCI_IER_OVRE_Pos                    _UINT32_(30)                                         /* (HSMCI_IER) Overrun Interrupt Enable Position */
#define HSMCI_IER_OVRE_Msk                    (_UINT32_(0x1) << HSMCI_IER_OVRE_Pos)                /* (HSMCI_IER) Overrun Interrupt Enable Mask */
#define HSMCI_IER_OVRE(value)                 (HSMCI_IER_OVRE_Msk & (_UINT32_(value) << HSMCI_IER_OVRE_Pos)) /* Assignment of value for OVRE in the HSMCI_IER register */
#define HSMCI_IER_UNRE_Pos                    _UINT32_(31)                                         /* (HSMCI_IER) Underrun Interrupt Enable Position */
#define HSMCI_IER_UNRE_Msk                    (_UINT32_(0x1) << HSMCI_IER_UNRE_Pos)                /* (HSMCI_IER) Underrun Interrupt Enable Mask */
#define HSMCI_IER_UNRE(value)                 (HSMCI_IER_UNRE_Msk & (_UINT32_(value) << HSMCI_IER_UNRE_Pos)) /* Assignment of value for UNRE in the HSMCI_IER register */
#define HSMCI_IER_Msk                         _UINT32_(0xFDFF313F)                                 /* (HSMCI_IER) Register Mask  */


