Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/hsmci.h
/* -------- HSMCI_IMR : (HSMCI Offset: 0x4C) ( R/ 32) Interrupt Mask Register -------- */
#define HSMCI_IMR_CMDRDY_Pos                  _UINT32_(0)                                          /* (HSMCI_IMR) Command Ready Interrupt Mask Position */
#define HSMCI_IMR_CMDRDY_Msk                  (_UINT32_(0x1) << HSMCI_IMR_CMDRDY_Pos)              /* (HSMCI_IMR) Command Ready Interrupt Mask Mask */
#define HSMCI_IMR_CMDRDY(value)               (HSMCI_IMR_CMDRDY_Msk & (_UINT32_(value) << HSMCI_IMR_CMDRDY_Pos)) /* Assignment of value for CMDRDY in the HSMCI_IMR register */
#define HSMCI_IMR_RXRDY_Pos                   _UINT32_(1)                                          /* (HSMCI_IMR) Receiver Ready Interrupt Mask Position */
#define HSMCI_IMR_RXRDY_Msk                   (_UINT32_(0x1) << HSMCI_IMR_RXRDY_Pos)               /* (HSMCI_IMR) Receiver Ready Interrupt Mask Mask */
#define HSMCI_IMR_RXRDY(value)                (HSMCI_IMR_RXRDY_Msk & (_UINT32_(value) << HSMCI_IMR_RXRDY_Pos)) /* Assignment of value for RXRDY in the HSMCI_IMR register */
#define HSMCI_IMR_TXRDY_Pos                   _UINT32_(2)                                          /* (HSMCI_IMR) Transmit Ready Interrupt Mask Position */
#define HSMCI_IMR_TXRDY_Msk                   (_UINT32_(0x1) << HSMCI_IMR_TXRDY_Pos)               /* (HSMCI_IMR) Transmit Ready Interrupt Mask Mask */
#define HSMCI_IMR_TXRDY(value)                (HSMCI_IMR_TXRDY_Msk & (_UINT32_(value) << HSMCI_IMR_TXRDY_Pos)) /* Assignment of value for TXRDY in the HSMCI_IMR register */
#define HSMCI_IMR_BLKE_Pos                    _UINT32_(3)                                          /* (HSMCI_IMR) Data Block Ended Interrupt Mask Position */
#define HSMCI_IMR_BLKE_Msk                    (_UINT32_(0x1) << HSMCI_IMR_BLKE_Pos)                /* (HSMCI_IMR) Data Block Ended Interrupt Mask Mask */
#define HSMCI_IMR_BLKE(value)                 (HSMCI_IMR_BLKE_Msk & (_UINT32_(value) << HSMCI_IMR_BLKE_Pos)) /* Assignment of value for BLKE in the HSMCI_IMR register */
#define HSMCI_IMR_DTIP_Pos                    _UINT32_(4)                                          /* (HSMCI_IMR) Data Transfer in Progress Interrupt Mask Position */
#define HSMCI_IMR_DTIP_Msk                    (_UINT32_(0x1) << HSMCI_IMR_DTIP_Pos)                /* (HSMCI_IMR) Data Transfer in Progress Interrupt Mask Mask */
#define HSMCI_IMR_DTIP(value)                 (HSMCI_IMR_DTIP_Msk & (_UINT32_(value) << HSMCI_IMR_DTIP_Pos)) /* Assignment of value for DTIP in the HSMCI_IMR register */
#define HSMCI_IMR_NOTBUSY_Pos                 _UINT32_(5)                                          /* (HSMCI_IMR) Data Not Busy Interrupt Mask Position */
#define HSMCI_IMR_NOTBUSY_Msk                 (_UINT32_(0x1) << HSMCI_IMR_NOTBUSY_Pos)             /* (HSMCI_IMR) Data Not Busy Interrupt Mask Mask */
#define HSMCI_IMR_NOTBUSY(value)              (HSMCI_IMR_NOTBUSY_Msk & (_UINT32_(value) << HSMCI_IMR_NOTBUSY_Pos)) /* Assignment of value for NOTBUSY in the HSMCI_IMR register */
#define HSMCI_IMR_SDIOIRQA_Pos                _UINT32_(8)                                          /* (HSMCI_IMR) SDIO Interrupt for Slot A Interrupt Mask Position */
#define HSMCI_IMR_SDIOIRQA_Msk                (_UINT32_(0x1) << HSMCI_IMR_SDIOIRQA_Pos)            /* (HSMCI_IMR) SDIO Interrupt for Slot A Interrupt Mask Mask */
#define HSMCI_IMR_SDIOIRQA(value)             (HSMCI_IMR_SDIOIRQA_Msk & (_UINT32_(value) << HSMCI_IMR_SDIOIRQA_Pos)) /* Assignment of value for SDIOIRQA in the HSMCI_IMR register */
#define HSMCI_IMR_SDIOWAIT_Pos                _UINT32_(12)                                         /* (HSMCI_IMR) SDIO Read Wait Operation Status Interrupt Mask Position */
#define HSMCI_IMR_SDIOWAIT_Msk                (_UINT32_(0x1) << HSMCI_IMR_SDIOWAIT_Pos)            /* (HSMCI_IMR) SDIO Read Wait Operation Status Interrupt Mask Mask */
#define HSMCI_IMR_SDIOWAIT(value)             (HSMCI_IMR_SDIOWAIT_Msk & (_UINT32_(value) << HSMCI_IMR_SDIOWAIT_Pos)) /* Assignment of value for SDIOWAIT in the HSMCI_IMR register */
#define HSMCI_IMR_CSRCV_Pos                   _UINT32_(13)                                         /* (HSMCI_IMR) Completion Signal Received Interrupt Mask Position */
#define HSMCI_IMR_CSRCV_Msk                   (_UINT32_(0x1) << HSMCI_IMR_CSRCV_Pos)               /* (HSMCI_IMR) Completion Signal Received Interrupt Mask Mask */
#define HSMCI_IMR_CSRCV(value)                (HSMCI_IMR_CSRCV_Msk & (_UINT32_(value) << HSMCI_IMR_CSRCV_Pos)) /* Assignment of value for CSRCV in the HSMCI_IMR register */
#define HSMCI_IMR_RINDE_Pos                   _UINT32_(16)                                         /* (HSMCI_IMR) Response Index Error Interrupt Mask Position */
#define HSMCI_IMR_RINDE_Msk                   (_UINT32_(0x1) << HSMCI_IMR_RINDE_Pos)               /* (HSMCI_IMR) Response Index Error Interrupt Mask Mask */
#define HSMCI_IMR_RINDE(value)                (HSMCI_IMR_RINDE_Msk & (_UINT32_(value) << HSMCI_IMR_RINDE_Pos)) /* Assignment of value for RINDE in the HSMCI_IMR register */
#define HSMCI_IMR_RDIRE_Pos                   _UINT32_(17)                                         /* (HSMCI_IMR) Response Direction Error Interrupt Mask Position */
#define HSMCI_IMR_RDIRE_Msk                   (_UINT32_(0x1) << HSMCI_IMR_RDIRE_Pos)               /* (HSMCI_IMR) Response Direction Error Interrupt Mask Mask */
#define HSMCI_IMR_RDIRE(value)                (HSMCI_IMR_RDIRE_Msk & (_UINT32_(value) << HSMCI_IMR_RDIRE_Pos)) /* Assignment of value for RDIRE in the HSMCI_IMR register */
#define HSMCI_IMR_RCRCE_Pos                   _UINT32_(18)                                         /* (HSMCI_IMR) Response CRC Error Interrupt Mask Position */
#define HSMCI_IMR_RCRCE_Msk                   (_UINT32_(0x1) << HSMCI_IMR_RCRCE_Pos)               /* (HSMCI_IMR) Response CRC Error Interrupt Mask Mask */
#define HSMCI_IMR_RCRCE(value)                (HSMCI_IMR_RCRCE_Msk & (_UINT32_(value) << HSMCI_IMR_RCRCE_Pos)) /* Assignment of value for RCRCE in the HSMCI_IMR register */
#define HSMCI_IMR_RENDE_Pos                   _UINT32_(19)                                         /* (HSMCI_IMR) Response End Bit Error Interrupt Mask Position */
#define HSMCI_IMR_RENDE_Msk                   (_UINT32_(0x1) << HSMCI_IMR_RENDE_Pos)               /* (HSMCI_IMR) Response End Bit Error Interrupt Mask Mask */
#define HSMCI_IMR_RENDE(value)                (HSMCI_IMR_RENDE_Msk & (_UINT32_(value) << HSMCI_IMR_RENDE_Pos)) /* Assignment of value for RENDE in the HSMCI_IMR register */
#define HSMCI_IMR_RTOE_Pos                    _UINT32_(20)                                         /* (HSMCI_IMR) Response Time-out Error Interrupt Mask Position */
#define HSMCI_IMR_RTOE_Msk                    (_UINT32_(0x1) << HSMCI_IMR_RTOE_Pos)                /* (HSMCI_IMR) Response Time-out Error Interrupt Mask Mask */
#define HSMCI_IMR_RTOE(value)                 (HSMCI_IMR_RTOE_Msk & (_UINT32_(value) << HSMCI_IMR_RTOE_Pos)) /* Assignment of value for RTOE in the HSMCI_IMR register */
#define HSMCI_IMR_DCRCE_Pos                   _UINT32_(21)                                         /* (HSMCI_IMR) Data CRC Error Interrupt Mask Position */
#define HSMCI_IMR_DCRCE_Msk                   (_UINT32_(0x1) << HSMCI_IMR_DCRCE_Pos)               /* (HSMCI_IMR) Data CRC Error Interrupt Mask Mask */
#define HSMCI_IMR_DCRCE(value)                (HSMCI_IMR_DCRCE_Msk & (_UINT32_(value) << HSMCI_IMR_DCRCE_Pos)) /* Assignment of value for DCRCE in the HSMCI_IMR register */
#define HSMCI_IMR_DTOE_Pos                    _UINT32_(22)                                         /* (HSMCI_IMR) Data Time-out Error Interrupt Mask Position */
#define HSMCI_IMR_DTOE_Msk                    (_UINT32_(0x1) << HSMCI_IMR_DTOE_Pos)                /* (HSMCI_IMR) Data Time-out Error Interrupt Mask Mask */
#define HSMCI_IMR_DTOE(value)                 (HSMCI_IMR_DTOE_Msk & (_UINT32_(value) << HSMCI_IMR_DTOE_Pos)) /* Assignment of value for DTOE in the HSMCI_IMR register */
#define HSMCI_IMR_CSTOE_Pos                   _UINT32_(23)                                         /* (HSMCI_IMR) Completion Signal Time-out Error Interrupt Mask Position */
#define HSMCI_IMR_CSTOE_Msk                   (_UINT32_(0x1) << HSMCI_IMR_CSTOE_Pos)               /* (HSMCI_IMR) Completion Signal Time-out Error Interrupt Mask Mask */
#define HSMCI_IMR_CSTOE(value)                (HSMCI_IMR_CSTOE_Msk & (_UINT32_(value) << HSMCI_IMR_CSTOE_Pos)) /* Assignment of value for CSTOE in the HSMCI_IMR register */
#define HSMCI_IMR_BLKOVRE_Pos                 _UINT32_(24)                                         /* (HSMCI_IMR) DMA Block Overrun Error Interrupt Mask Position */
#define HSMCI_IMR_BLKOVRE_Msk                 (_UINT32_(0x1) << HSMCI_IMR_BLKOVRE_Pos)             /* (HSMCI_IMR) DMA Block Overrun Error Interrupt Mask Mask */
#define HSMCI_IMR_BLKOVRE(value)              (HSMCI_IMR_BLKOVRE_Msk & (_UINT32_(value) << HSMCI_IMR_BLKOVRE_Pos)) /* Assignment of value for BLKOVRE in the HSMCI_IMR register */
#define HSMCI_IMR_FIFOEMPTY_Pos               _UINT32_(26)                                         /* (HSMCI_IMR) FIFO Empty Interrupt Mask Position */
#define HSMCI_IMR_FIFOEMPTY_Msk               (_UINT32_(0x1) << HSMCI_IMR_FIFOEMPTY_Pos)           /* (HSMCI_IMR) FIFO Empty Interrupt Mask Mask */
#define HSMCI_IMR_FIFOEMPTY(value)            (HSMCI_IMR_FIFOEMPTY_Msk & (_UINT32_(value) << HSMCI_IMR_FIFOEMPTY_Pos)) /* Assignment of value for FIFOEMPTY in the HSMCI_IMR register */
#define HSMCI_IMR_XFRDONE_Pos                 _UINT32_(27)                                         /* (HSMCI_IMR) Transfer Done Interrupt Mask Position */
#define HSMCI_IMR_XFRDONE_Msk                 (_UINT32_(0x1) << HSMCI_IMR_XFRDONE_Pos)             /* (HSMCI_IMR) Transfer Done Interrupt Mask Mask */
#define HSMCI_IMR_XFRDONE(value)              (HSMCI_IMR_XFRDONE_Msk & (_UINT32_(value) << HSMCI_IMR_XFRDONE_Pos)) /* Assignment of value for XFRDONE in the HSMCI_IMR register */
#define HSMCI_IMR_ACKRCV_Pos                  _UINT32_(28)                                         /* (HSMCI_IMR) Boot Operation Acknowledge Received Interrupt Mask Position */
#define HSMCI_IMR_ACKRCV_Msk                  (_UINT32_(0x1) << HSMCI_IMR_ACKRCV_Pos)              /* (HSMCI_IMR) Boot Operation Acknowledge Received Interrupt Mask Mask */
#define HSMCI_IMR_ACKRCV(value)               (HSMCI_IMR_ACKRCV_Msk & (_UINT32_(value) << HSMCI_IMR_ACKRCV_Pos)) /* Assignment of value for ACKRCV in the HSMCI_IMR register */
#define HSMCI_IMR_ACKRCVE_Pos                 _UINT32_(29)                                         /* (HSMCI_IMR) Boot Operation Acknowledge Error Interrupt Mask Position */
#define HSMCI_IMR_ACKRCVE_Msk                 (_UINT32_(0x1) << HSMCI_IMR_ACKRCVE_Pos)             /* (HSMCI_IMR) Boot Operation Acknowledge Error Interrupt Mask Mask */
#define HSMCI_IMR_ACKRCVE(value)              (HSMCI_IMR_ACKRCVE_Msk & (_UINT32_(value) << HSMCI_IMR_ACKRCVE_Pos)) /* Assignment of value for ACKRCVE in the HSMCI_IMR register */
#define HSMCI_IMR_OVRE_Pos                    _UINT32_(30)                                         /* (HSMCI_IMR) Overrun Interrupt Mask Position */
#define HSMCI_IMR_OVRE_Msk                    (_UINT32_(0x1) << HSMCI_IMR_OVRE_Pos)                /* (HSMCI_IMR) Overrun Interrupt Mask Mask */
#define HSMCI_IMR_OVRE(value)                 (HSMCI_IMR_OVRE_Msk & (_UINT32_(value) << HSMCI_IMR_OVRE_Pos)) /* Assignment of value for OVRE in the HSMCI_IMR register */
#define HSMCI_IMR_UNRE_Pos                    _UINT32_(31)                                         /* (HSMCI_IMR) Underrun Interrupt Mask Position */
#define HSMCI_IMR_UNRE_Msk                    (_UINT32_(0x1) << HSMCI_IMR_UNRE_Pos)                /* (HSMCI_IMR) Underrun Interrupt Mask Mask */
#define HSMCI_IMR_UNRE(value)                 (HSMCI_IMR_UNRE_Msk & (_UINT32_(value) << HSMCI_IMR_UNRE_Pos)) /* Assignment of value for UNRE in the HSMCI_IMR register */
#define HSMCI_IMR_Msk                         _UINT32_(0xFDFF313F)                                 /* (HSMCI_IMR) Register Mask  */


/* -------- HSMCI_DMA : (HSMCI Offset: 0x50) (R/W 32) DMA Configuration Register -------- */
#define HSMCI_DMA_CHKSIZE_Pos                 _UINT32_(4)                                          /* (HSMCI_DMA) DMA Channel Read and Write Chunk Size Position */
#define HSMCI_DMA_CHKSIZE_Msk                 (_UINT32_(0x7) << HSMCI_DMA_CHKSIZE_Pos)             /* (HSMCI_DMA) DMA Channel Read and Write Chunk Size Mask */
#define HSMCI_DMA_CHKSIZE(value)              (HSMCI_DMA_CHKSIZE_Msk & (_UINT32_(value) << HSMCI_DMA_CHKSIZE_Pos)) /* Assignment of value for CHKSIZE in the HSMCI_DMA register */
#define   HSMCI_DMA_CHKSIZE_1_Val             _UINT32_(0x0)                                        /* (HSMCI_DMA) 1 data available  */
#define   HSMCI_DMA_CHKSIZE_2_Val             _UINT32_(0x1)                                        /* (HSMCI_DMA) 2 data available  */
#define   HSMCI_DMA_CHKSIZE_4_Val             _UINT32_(0x2)                                        /* (HSMCI_DMA) 4 data available  */
#define   HSMCI_DMA_CHKSIZE_8_Val             _UINT32_(0x3)                                        /* (HSMCI_DMA) 8 data available  */
#define   HSMCI_DMA_CHKSIZE_16_Val            _UINT32_(0x4)                                        /* (HSMCI_DMA) 16 data available  */
#define HSMCI_DMA_CHKSIZE_1                   (HSMCI_DMA_CHKSIZE_1_Val << HSMCI_DMA_CHKSIZE_Pos)   /* (HSMCI_DMA) 1 data available Position */
#define HSMCI_DMA_CHKSIZE_2                   (HSMCI_DMA_CHKSIZE_2_Val << HSMCI_DMA_CHKSIZE_Pos)   /* (HSMCI_DMA) 2 data available Position */
#define HSMCI_DMA_CHKSIZE_4                   (HSMCI_DMA_CHKSIZE_4_Val << HSMCI_DMA_CHKSIZE_Pos)   /* (HSMCI_DMA) 4 data available Position */
#define HSMCI_DMA_CHKSIZE_8                   (HSMCI_DMA_CHKSIZE_8_Val << HSMCI_DMA_CHKSIZE_Pos)   /* (HSMCI_DMA) 8 data available Position */
#define HSMCI_DMA_CHKSIZE_16                  (HSMCI_DMA_CHKSIZE_16_Val << HSMCI_DMA_CHKSIZE_Pos)  /* (HSMCI_DMA) 16 data available Position */
#define HSMCI_DMA_DMAEN_Pos                   _UINT32_(8)                                          /* (HSMCI_DMA) DMA Hardware Handshaking Enable Position */
#define HSMCI_DMA_DMAEN_Msk                   (_UINT32_(0x1) << HSMCI_DMA_DMAEN_Pos)               /* (HSMCI_DMA) DMA Hardware Handshaking Enable Mask */
#define HSMCI_DMA_DMAEN(value)                (HSMCI_DMA_DMAEN_Msk & (_UINT32_(value) << HSMCI_DMA_DMAEN_Pos)) /* Assignment of value for DMAEN in the HSMCI_DMA register */
#define HSMCI_DMA_Msk                         _UINT32_(0x00000170)                                 /* (HSMCI_DMA) Register Mask  */


