Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/hsmci.h
/* -------- HSMCI_CFG : (HSMCI Offset: 0x54) (R/W 32) Configuration Register -------- */
#define HSMCI_CFG_FIFOMODE_Pos                _UINT32_(0)                                          /* (HSMCI_CFG) HSMCI Internal FIFO control mode Position */
#define HSMCI_CFG_FIFOMODE_Msk                (_UINT32_(0x1) << HSMCI_CFG_FIFOMODE_Pos)            /* (HSMCI_CFG) HSMCI Internal FIFO control mode Mask */
#define HSMCI_CFG_FIFOMODE(value)             (HSMCI_CFG_FIFOMODE_Msk & (_UINT32_(value) << HSMCI_CFG_FIFOMODE_Pos)) /* Assignment of value for FIFOMODE in the HSMCI_CFG register */
#define HSMCI_CFG_FERRCTRL_Pos                _UINT32_(4)                                          /* (HSMCI_CFG) Flow Error flag reset control mode Position */
#define HSMCI_CFG_FERRCTRL_Msk                (_UINT32_(0x1) << HSMCI_CFG_FERRCTRL_Pos)            /* (HSMCI_CFG) Flow Error flag reset control mode Mask */
#define HSMCI_CFG_FERRCTRL(value)             (HSMCI_CFG_FERRCTRL_Msk & (_UINT32_(value) << HSMCI_CFG_FERRCTRL_Pos)) /* Assignment of value for FERRCTRL in the HSMCI_CFG register */
#define HSMCI_CFG_HSMODE_Pos                  _UINT32_(8)                                          /* (HSMCI_CFG) High Speed Mode Position */
#define HSMCI_CFG_HSMODE_Msk                  (_UINT32_(0x1) << HSMCI_CFG_HSMODE_Pos)              /* (HSMCI_CFG) High Speed Mode Mask */
#define HSMCI_CFG_HSMODE(value)               (HSMCI_CFG_HSMODE_Msk & (_UINT32_(value) << HSMCI_CFG_HSMODE_Pos)) /* Assignment of value for HSMODE in the HSMCI_CFG register */
#define HSMCI_CFG_LSYNC_Pos                   _UINT32_(12)                                         /* (HSMCI_CFG) Synchronize on the last block Position */
#define HSMCI_CFG_LSYNC_Msk                   (_UINT32_(0x1) << HSMCI_CFG_LSYNC_Pos)               /* (HSMCI_CFG) Synchronize on the last block Mask */
#define HSMCI_CFG_LSYNC(value)                (HSMCI_CFG_LSYNC_Msk & (_UINT32_(value) << HSMCI_CFG_LSYNC_Pos)) /* Assignment of value for LSYNC in the HSMCI_CFG register */
#define HSMCI_CFG_Msk                         _UINT32_(0x00001111)                                 /* (HSMCI_CFG) Register Mask  */


/* -------- HSMCI_WPMR : (HSMCI Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define HSMCI_WPMR_WPEN_Pos                   _UINT32_(0)                                          /* (HSMCI_WPMR) Write Protect Enable Position */
#define HSMCI_WPMR_WPEN_Msk                   (_UINT32_(0x1) << HSMCI_WPMR_WPEN_Pos)               /* (HSMCI_WPMR) Write Protect Enable Mask */
#define HSMCI_WPMR_WPEN(value)                (HSMCI_WPMR_WPEN_Msk & (_UINT32_(value) << HSMCI_WPMR_WPEN_Pos)) /* Assignment of value for WPEN in the HSMCI_WPMR register */
#define HSMCI_WPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (HSMCI_WPMR) Write Protect Key Position */
#define HSMCI_WPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << HSMCI_WPMR_WPKEY_Pos)         /* (HSMCI_WPMR) Write Protect Key Mask */
#define HSMCI_WPMR_WPKEY(value)               (HSMCI_WPMR_WPKEY_Msk & (_UINT32_(value) << HSMCI_WPMR_WPKEY_Pos)) /* Assignment of value for WPKEY in the HSMCI_WPMR register */
#define   HSMCI_WPMR_WPKEY_PASSWD_Val         _UINT32_(0x4D4349)                                   /* (HSMCI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define HSMCI_WPMR_WPKEY_PASSWD               (HSMCI_WPMR_WPKEY_PASSWD_Val << HSMCI_WPMR_WPKEY_Pos) /* (HSMCI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position */
#define HSMCI_WPMR_Msk                        _UINT32_(0xFFFFFF01)                                 /* (HSMCI_WPMR) Register Mask  */


/* -------- HSMCI_WPSR : (HSMCI Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define HSMCI_WPSR_WPVS_Pos                   _UINT32_(0)                                          /* (HSMCI_WPSR) Write Protection Violation Status Position */
#define HSMCI_WPSR_WPVS_Msk                   (_UINT32_(0x1) << HSMCI_WPSR_WPVS_Pos)               /* (HSMCI_WPSR) Write Protection Violation Status Mask */
#define HSMCI_WPSR_WPVS(value)                (HSMCI_WPSR_WPVS_Msk & (_UINT32_(value) << HSMCI_WPSR_WPVS_Pos)) /* Assignment of value for WPVS in the HSMCI_WPSR register */
#define HSMCI_WPSR_WPVSRC_Pos                 _UINT32_(8)                                          /* (HSMCI_WPSR) Write Protection Violation Source Position */
#define HSMCI_WPSR_WPVSRC_Msk                 (_UINT32_(0xFFFF) << HSMCI_WPSR_WPVSRC_Pos)          /* (HSMCI_WPSR) Write Protection Violation Source Mask */
#define HSMCI_WPSR_WPVSRC(value)              (HSMCI_WPSR_WPVSRC_Msk & (_UINT32_(value) << HSMCI_WPSR_WPVSRC_Pos)) /* Assignment of value for WPVSRC in the HSMCI_WPSR register */
#define HSMCI_WPSR_Msk                        _UINT32_(0x00FFFF01)                                 /* (HSMCI_WPSR) Register Mask  */


/* -------- HSMCI_FIFO : (HSMCI Offset: 0x200) (R/W 32) FIFO Memory Aperture0 0 -------- */
#define HSMCI_FIFO_DATA_Pos                   _UINT32_(0)                                          /* (HSMCI_FIFO) Data to Read or Data to Write Position */
#define HSMCI_FIFO_DATA_Msk                   (_UINT32_(0xFFFFFFFF) << HSMCI_FIFO_DATA_Pos)        /* (HSMCI_FIFO) Data to Read or Data to Write Mask */
#define HSMCI_FIFO_DATA(value)                (HSMCI_FIFO_DATA_Msk & (_UINT32_(value) << HSMCI_FIFO_DATA_Pos)) /* Assignment of value for DATA in the HSMCI_FIFO register */
#define HSMCI_FIFO_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (HSMCI_FIFO) Register Mask  */


/* HSMCI register offsets definitions */
#define HSMCI_CR_REG_OFST              _UINT32_(0x00)      /* (HSMCI_CR) Control Register Offset */
#define HSMCI_MR_REG_OFST              _UINT32_(0x04)      /* (HSMCI_MR) Mode Register Offset */
#define HSMCI_DTOR_REG_OFST            _UINT32_(0x08)      /* (HSMCI_DTOR) Data Timeout Register Offset */
#define HSMCI_SDCR_REG_OFST            _UINT32_(0x0C)      /* (HSMCI_SDCR) SD/SDIO Card Register Offset */
#define HSMCI_ARGR_REG_OFST            _UINT32_(0x10)      /* (HSMCI_ARGR) Argument Register Offset */
#define HSMCI_CMDR_REG_OFST            _UINT32_(0x14)      /* (HSMCI_CMDR) Command Register Offset */
#define HSMCI_BLKR_REG_OFST            _UINT32_(0x18)      /* (HSMCI_BLKR) Block Register Offset */
#define HSMCI_CSTOR_REG_OFST           _UINT32_(0x1C)      /* (HSMCI_CSTOR) Completion Signal Timeout Register Offset */
#define HSMCI_RSPR_REG_OFST            _UINT32_(0x20)      /* (HSMCI_RSPR) Response Register 0 Offset */
#define HSMCI_RSPR0_REG_OFST           _UINT32_(0x20)      /* (HSMCI_RSPR0) Response Register 0 Offset */
#define HSMCI_RSPR1_REG_OFST           _UINT32_(0x24)      /* (HSMCI_RSPR1) Response Register 0 Offset */
#define HSMCI_RSPR2_REG_OFST           _UINT32_(0x28)      /* (HSMCI_RSPR2) Response Register 0 Offset */
#define HSMCI_RSPR3_REG_OFST           _UINT32_(0x2C)      /* (HSMCI_RSPR3) Response Register 0 Offset */
#define HSMCI_RDR_REG_OFST             _UINT32_(0x30)      /* (HSMCI_RDR) Receive Data Register Offset */
#define HSMCI_TDR_REG_OFST             _UINT32_(0x34)      /* (HSMCI_TDR) Transmit Data Register Offset */
#define HSMCI_SR_REG_OFST              _UINT32_(0x40)      /* (HSMCI_SR) Status Register Offset */
#define HSMCI_IER_REG_OFST             _UINT32_(0x44)      /* (HSMCI_IER) Interrupt Enable Register Offset */
#define HSMCI_IDR_REG_OFST             _UINT32_(0x48)      /* (HSMCI_IDR) Interrupt Disable Register Offset */
#define HSMCI_IMR_REG_OFST             _UINT32_(0x4C)      /* (HSMCI_IMR) Interrupt Mask Register Offset */
#define HSMCI_DMA_REG_OFST             _UINT32_(0x50)      /* (HSMCI_DMA) DMA Configuration Register Offset */
#define HSMCI_CFG_REG_OFST             _UINT32_(0x54)      /* (HSMCI_CFG) Configuration Register Offset */
#define HSMCI_WPMR_REG_OFST            _UINT32_(0xE4)      /* (HSMCI_WPMR) Write Protection Mode Register Offset */
#define HSMCI_WPSR_REG_OFST            _UINT32_(0xE8)      /* (HSMCI_WPSR) Write Protection Status Register Offset */
#define HSMCI_FIFO_REG_OFST            _UINT32_(0x200)     /* (HSMCI_FIFO) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO0_REG_OFST           _UINT32_(0x200)     /* (HSMCI_FIFO0) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO1_REG_OFST           _UINT32_(0x204)     /* (HSMCI_FIFO1) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO2_REG_OFST           _UINT32_(0x208)     /* (HSMCI_FIFO2) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO3_REG_OFST           _UINT32_(0x20C)     /* (HSMCI_FIFO3) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO4_REG_OFST           _UINT32_(0x210)     /* (HSMCI_FIFO4) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO5_REG_OFST           _UINT32_(0x214)     /* (HSMCI_FIFO5) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO6_REG_OFST           _UINT32_(0x218)     /* (HSMCI_FIFO6) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO7_REG_OFST           _UINT32_(0x21C)     /* (HSMCI_FIFO7) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO8_REG_OFST           _UINT32_(0x220)     /* (HSMCI_FIFO8) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO9_REG_OFST           _UINT32_(0x224)     /* (HSMCI_FIFO9) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO10_REG_OFST          _UINT32_(0x228)     /* (HSMCI_FIFO10) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO11_REG_OFST          _UINT32_(0x22C)     /* (HSMCI_FIFO11) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO12_REG_OFST          _UINT32_(0x230)     /* (HSMCI_FIFO12) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO13_REG_OFST          _UINT32_(0x234)     /* (HSMCI_FIFO13) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO14_REG_OFST          _UINT32_(0x238)     /* (HSMCI_FIFO14) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO15_REG_OFST          _UINT32_(0x23C)     /* (HSMCI_FIFO15) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO16_REG_OFST          _UINT32_(0x240)     /* (HSMCI_FIFO16) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO17_REG_OFST          _UINT32_(0x244)     /* (HSMCI_FIFO17) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO18_REG_OFST          _UINT32_(0x248)     /* (HSMCI_FIFO18) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO19_REG_OFST          _UINT32_(0x24C)     /* (HSMCI_FIFO19) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO20_REG_OFST          _UINT32_(0x250)     /* (HSMCI_FIFO20) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO21_REG_OFST          _UINT32_(0x254)     /* (HSMCI_FIFO21) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO22_REG_OFST          _UINT32_(0x258)     /* (HSMCI_FIFO22) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO23_REG_OFST          _UINT32_(0x25C)     /* (HSMCI_FIFO23) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO24_REG_OFST          _UINT32_(0x260)     /* (HSMCI_FIFO24) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO25_REG_OFST          _UINT32_(0x264)     /* (HSMCI_FIFO25) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO26_REG_OFST          _UINT32_(0x268)     /* (HSMCI_FIFO26) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO27_REG_OFST          _UINT32_(0x26C)     /* (HSMCI_FIFO27) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO28_REG_OFST          _UINT32_(0x270)     /* (HSMCI_FIFO28) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO29_REG_OFST          _UINT32_(0x274)     /* (HSMCI_FIFO29) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO30_REG_OFST          _UINT32_(0x278)     /* (HSMCI_FIFO30) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO31_REG_OFST          _UINT32_(0x27C)     /* (HSMCI_FIFO31) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO32_REG_OFST          _UINT32_(0x280)     /* (HSMCI_FIFO32) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO33_REG_OFST          _UINT32_(0x284)     /* (HSMCI_FIFO33) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO34_REG_OFST          _UINT32_(0x288)     /* (HSMCI_FIFO34) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO35_REG_OFST          _UINT32_(0x28C)     /* (HSMCI_FIFO35) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO36_REG_OFST          _UINT32_(0x290)     /* (HSMCI_FIFO36) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO37_REG_OFST          _UINT32_(0x294)     /* (HSMCI_FIFO37) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO38_REG_OFST          _UINT32_(0x298)     /* (HSMCI_FIFO38) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO39_REG_OFST          _UINT32_(0x29C)     /* (HSMCI_FIFO39) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO40_REG_OFST          _UINT32_(0x2A0)     /* (HSMCI_FIFO40) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO41_REG_OFST          _UINT32_(0x2A4)     /* (HSMCI_FIFO41) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO42_REG_OFST          _UINT32_(0x2A8)     /* (HSMCI_FIFO42) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO43_REG_OFST          _UINT32_(0x2AC)     /* (HSMCI_FIFO43) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO44_REG_OFST          _UINT32_(0x2B0)     /* (HSMCI_FIFO44) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO45_REG_OFST          _UINT32_(0x2B4)     /* (HSMCI_FIFO45) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO46_REG_OFST          _UINT32_(0x2B8)     /* (HSMCI_FIFO46) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO47_REG_OFST          _UINT32_(0x2BC)     /* (HSMCI_FIFO47) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO48_REG_OFST          _UINT32_(0x2C0)     /* (HSMCI_FIFO48) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO49_REG_OFST          _UINT32_(0x2C4)     /* (HSMCI_FIFO49) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO50_REG_OFST          _UINT32_(0x2C8)     /* (HSMCI_FIFO50) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO51_REG_OFST          _UINT32_(0x2CC)     /* (HSMCI_FIFO51) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO52_REG_OFST          _UINT32_(0x2D0)     /* (HSMCI_FIFO52) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO53_REG_OFST          _UINT32_(0x2D4)     /* (HSMCI_FIFO53) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO54_REG_OFST          _UINT32_(0x2D8)     /* (HSMCI_FIFO54) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO55_REG_OFST          _UINT32_(0x2DC)     /* (HSMCI_FIFO55) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO56_REG_OFST          _UINT32_(0x2E0)     /* (HSMCI_FIFO56) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO57_REG_OFST          _UINT32_(0x2E4)     /* (HSMCI_FIFO57) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO58_REG_OFST          _UINT32_(0x2E8)     /* (HSMCI_FIFO58) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO59_REG_OFST          _UINT32_(0x2EC)     /* (HSMCI_FIFO59) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO60_REG_OFST          _UINT32_(0x2F0)     /* (HSMCI_FIFO60) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO61_REG_OFST          _UINT32_(0x2F4)     /* (HSMCI_FIFO61) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO62_REG_OFST          _UINT32_(0x2F8)     /* (HSMCI_FIFO62) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO63_REG_OFST          _UINT32_(0x2FC)     /* (HSMCI_FIFO63) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO64_REG_OFST          _UINT32_(0x300)     /* (HSMCI_FIFO64) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO65_REG_OFST          _UINT32_(0x304)     /* (HSMCI_FIFO65) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO66_REG_OFST          _UINT32_(0x308)     /* (HSMCI_FIFO66) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO67_REG_OFST          _UINT32_(0x30C)     /* (HSMCI_FIFO67) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO68_REG_OFST          _UINT32_(0x310)     /* (HSMCI_FIFO68) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO69_REG_OFST          _UINT32_(0x314)     /* (HSMCI_FIFO69) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO70_REG_OFST          _UINT32_(0x318)     /* (HSMCI_FIFO70) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO71_REG_OFST          _UINT32_(0x31C)     /* (HSMCI_FIFO71) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO72_REG_OFST          _UINT32_(0x320)     /* (HSMCI_FIFO72) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO73_REG_OFST          _UINT32_(0x324)     /* (HSMCI_FIFO73) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO74_REG_OFST          _UINT32_(0x328)     /* (HSMCI_FIFO74) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO75_REG_OFST          _UINT32_(0x32C)     /* (HSMCI_FIFO75) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO76_REG_OFST          _UINT32_(0x330)     /* (HSMCI_FIFO76) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO77_REG_OFST          _UINT32_(0x334)     /* (HSMCI_FIFO77) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO78_REG_OFST          _UINT32_(0x338)     /* (HSMCI_FIFO78) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO79_REG_OFST          _UINT32_(0x33C)     /* (HSMCI_FIFO79) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO80_REG_OFST          _UINT32_(0x340)     /* (HSMCI_FIFO80) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO81_REG_OFST          _UINT32_(0x344)     /* (HSMCI_FIFO81) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO82_REG_OFST          _UINT32_(0x348)     /* (HSMCI_FIFO82) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO83_REG_OFST          _UINT32_(0x34C)     /* (HSMCI_FIFO83) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO84_REG_OFST          _UINT32_(0x350)     /* (HSMCI_FIFO84) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO85_REG_OFST          _UINT32_(0x354)     /* (HSMCI_FIFO85) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO86_REG_OFST          _UINT32_(0x358)     /* (HSMCI_FIFO86) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO87_REG_OFST          _UINT32_(0x35C)     /* (HSMCI_FIFO87) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO88_REG_OFST          _UINT32_(0x360)     /* (HSMCI_FIFO88) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO89_REG_OFST          _UINT32_(0x364)     /* (HSMCI_FIFO89) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO90_REG_OFST          _UINT32_(0x368)     /* (HSMCI_FIFO90) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO91_REG_OFST          _UINT32_(0x36C)     /* (HSMCI_FIFO91) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO92_REG_OFST          _UINT32_(0x370)     /* (HSMCI_FIFO92) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO93_REG_OFST          _UINT32_(0x374)     /* (HSMCI_FIFO93) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO94_REG_OFST          _UINT32_(0x378)     /* (HSMCI_FIFO94) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO95_REG_OFST          _UINT32_(0x37C)     /* (HSMCI_FIFO95) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO96_REG_OFST          _UINT32_(0x380)     /* (HSMCI_FIFO96) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO97_REG_OFST          _UINT32_(0x384)     /* (HSMCI_FIFO97) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO98_REG_OFST          _UINT32_(0x388)     /* (HSMCI_FIFO98) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO99_REG_OFST          _UINT32_(0x38C)     /* (HSMCI_FIFO99) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO100_REG_OFST         _UINT32_(0x390)     /* (HSMCI_FIFO100) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO101_REG_OFST         _UINT32_(0x394)     /* (HSMCI_FIFO101) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO102_REG_OFST         _UINT32_(0x398)     /* (HSMCI_FIFO102) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO103_REG_OFST         _UINT32_(0x39C)     /* (HSMCI_FIFO103) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO104_REG_OFST         _UINT32_(0x3A0)     /* (HSMCI_FIFO104) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO105_REG_OFST         _UINT32_(0x3A4)     /* (HSMCI_FIFO105) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO106_REG_OFST         _UINT32_(0x3A8)     /* (HSMCI_FIFO106) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO107_REG_OFST         _UINT32_(0x3AC)     /* (HSMCI_FIFO107) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO108_REG_OFST         _UINT32_(0x3B0)     /* (HSMCI_FIFO108) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO109_REG_OFST         _UINT32_(0x3B4)     /* (HSMCI_FIFO109) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO110_REG_OFST         _UINT32_(0x3B8)     /* (HSMCI_FIFO110) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO111_REG_OFST         _UINT32_(0x3BC)     /* (HSMCI_FIFO111) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO112_REG_OFST         _UINT32_(0x3C0)     /* (HSMCI_FIFO112) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO113_REG_OFST         _UINT32_(0x3C4)     /* (HSMCI_FIFO113) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO114_REG_OFST         _UINT32_(0x3C8)     /* (HSMCI_FIFO114) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO115_REG_OFST         _UINT32_(0x3CC)     /* (HSMCI_FIFO115) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO116_REG_OFST         _UINT32_(0x3D0)     /* (HSMCI_FIFO116) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO117_REG_OFST         _UINT32_(0x3D4)     /* (HSMCI_FIFO117) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO118_REG_OFST         _UINT32_(0x3D8)     /* (HSMCI_FIFO118) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO119_REG_OFST         _UINT32_(0x3DC)     /* (HSMCI_FIFO119) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO120_REG_OFST         _UINT32_(0x3E0)     /* (HSMCI_FIFO120) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO121_REG_OFST         _UINT32_(0x3E4)     /* (HSMCI_FIFO121) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO122_REG_OFST         _UINT32_(0x3E8)     /* (HSMCI_FIFO122) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO123_REG_OFST         _UINT32_(0x3EC)     /* (HSMCI_FIFO123) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO124_REG_OFST         _UINT32_(0x3F0)     /* (HSMCI_FIFO124) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO125_REG_OFST         _UINT32_(0x3F4)     /* (HSMCI_FIFO125) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO126_REG_OFST         _UINT32_(0x3F8)     /* (HSMCI_FIFO126) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO127_REG_OFST         _UINT32_(0x3FC)     /* (HSMCI_FIFO127) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO128_REG_OFST         _UINT32_(0x400)     /* (HSMCI_FIFO128) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO129_REG_OFST         _UINT32_(0x404)     /* (HSMCI_FIFO129) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO130_REG_OFST         _UINT32_(0x408)     /* (HSMCI_FIFO130) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO131_REG_OFST         _UINT32_(0x40C)     /* (HSMCI_FIFO131) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO132_REG_OFST         _UINT32_(0x410)     /* (HSMCI_FIFO132) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO133_REG_OFST         _UINT32_(0x414)     /* (HSMCI_FIFO133) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO134_REG_OFST         _UINT32_(0x418)     /* (HSMCI_FIFO134) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO135_REG_OFST         _UINT32_(0x41C)     /* (HSMCI_FIFO135) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO136_REG_OFST         _UINT32_(0x420)     /* (HSMCI_FIFO136) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO137_REG_OFST         _UINT32_(0x424)     /* (HSMCI_FIFO137) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO138_REG_OFST         _UINT32_(0x428)     /* (HSMCI_FIFO138) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO139_REG_OFST         _UINT32_(0x42C)     /* (HSMCI_FIFO139) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO140_REG_OFST         _UINT32_(0x430)     /* (HSMCI_FIFO140) FIFO Memory Aperture0 0 Offset */
